In [30]:
import numpy as np
import pandas as pd

#### Creating a DataFrame

In [31]:
data = {
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Age': [28, 34, 29, 42],
    'City': ['New York', 'Paris', 'Berlin', 'London'],
    'Salary': [65000, 70000, 62000, 85000]
}
df = pd.DataFrame(data)

In [32]:
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [33]:
data_list = [
    ['John', 28, 'New York', 65000],
    ['Anna', 34, 'Paris', 70000],
    ['Peter', 29, 'Berlin', 62000],
    ['Linda', 42, 'London', 85000]
]
df2 = pd.DataFrame(data_list)
columns = ['Name', 'Age', 'City', 'Salary']
df2 = pd.DataFrame(data_list, columns=columns)

In [34]:
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

#### Selection and indexing of column

In [35]:
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [36]:
df2['City']

0    New York
1       Paris
2      Berlin
3      London
Name: City, dtype: str

In [37]:
df2[["Name", "City"]]

    Name      City
0   John  New York
1   Anna     Paris
2  Peter    Berlin
3  Linda    London

#### Creating a new column

In [38]:
df2["Designation"] = ["Engineer", "Manager", "Analyst", "Director"]

In [39]:
df2

    Name  Age      City  Salary Designation
0   John   28  New York   65000    Engineer
1   Anna   34     Paris   70000     Manager
2  Peter   29    Berlin   62000     Analyst
3  Linda   42    London   85000    Director

In [40]:
df2.drop("City", axis=1)
# Use implace=True to make the changes permanent

    Name  Age  Salary Designation
0   John   28   65000    Engineer
1   Anna   34   70000     Manager
2  Peter   29   62000     Analyst
3  Linda   42   85000    Director

In [42]:
df2.drop(0, axis=0)

    Name  Age    City  Salary Designation
1   Anna   34   Paris   70000     Manager
2  Peter   29  Berlin   62000     Analyst
3  Linda   42  London   85000    Director

In [43]:
df2

    Name  Age      City  Salary Designation
0   John   28  New York   65000    Engineer
1   Anna   34     Paris   70000     Manager
2  Peter   29    Berlin   62000     Analyst
3  Linda   42    London   85000    Director